'use strict';

let questions = [
    {
        text: 'Загадка первая: В какой из стран постсоветского пространства была "джинсовая революция"?',
        variables: {
            'a': 'в Украине',
            'b': 'в Молдавии',
            'c': 'в Казахстане',
            'd': 'в Белоруссии',
        },
        correctAnswerIndex: 'd',
    },
    {
        text: 'Загадка вторая: Где находится штаб-квартира НАТО?',
        variables: {
            'a': 'в США',
            'b': 'в Великобритании',
            'c': 'во Франции',
            'd': 'в Бельгии',
        },
        correctAnswerIndex: 'd',
    },
    {
        text: 'Загадка третья: Какое происхождение у Немецкого Канцлера Ангелы Меркель?',
        variables: {
            'a': 'частично французское',
            'b': 'частично французское',
            'c': 'частично польское',
            'd': 'частично английское',
        },
        correctAnswerIndex: 'c',
    },
    {
        text: 'Загадка четвертая: 30 марта 1981 года президент США Рональд Рейган был ранен Джоном Хинкли-младшим. Какие были мотивы преступления?',
        variables: {
            'a': 'он был анархистом',
            'b': 'он хотел произвести впечатление на Джоди Фостер',
            'c': 'он был снайпером и работал по заказу неизвестных',
            'd': 'он был сторонником кубинской революции',
        },
        correctAnswerIndex: 'b',
    },
]